'use client';

import Link from 'next/link';
import Image from 'next/image';
import styles from './About.module.scss';

export default function About() {
    return (
        <div className={styles.body}>
            <h1>Мой подход</h1>
            <p>
            Жизнь часто ставит перед нами вопросы, на которые нет готовых ответов. Я убедился в этом за 24 года служения священником и за годы практики как психолог.
<br /><br />
Меня зовут Андрей Шамро. Мой путь — это переход от следования догмам и правилам к глубокой вере в человека. Я знаю, что найти свой собственный путь бывает не просто. Сомнения и трудности воспринимаются нами исключительно как препятствия. А что, если сменить точку восприятия, увидеть во всем этом ближайшую зону развития?
<br /><br />

Я верю: в каждом человеке есть сила, направленная к жизни. Даже когда кажется — «сломлен», даже когда роста не видно. Моя задача — помочь Вам увидеть эту силу и довериться ей.
<br /><br />
С кем я работаю:
<br /><br />
🔹 Психологи, которые ищут свой профессиональный голос, хотят обрести уверенность в своём деле без шаблонов и инструкций.
<br />
🔹 Люди на рубеже перемен: в кризисе идентичности, в поиске себя после расставания, в переходе к новому жизненному этапу. Когда старая картина мира перестала работать, а новая ещё не сложилась.
<br /><br />
Как я работаю<br />
Я не даю готовых рецептов. Я создаю пространство, в котором вы можете:
<br /><br />
🌱 Увидеть себя без оценок — снять чужие «надо» и «правильно», наконец посмотреть на себя своими глазами<br />
🗝 Понять сложное через простое — я говорю на языке живых образов, а не абстрактных терминов<br />
🤝 Двигаться в своём темпе — я не толкаю, не ломаю, не тащу. Я рядом. Как внимательный спутник<br />
<br /><br />
Моя позиция: «Спасибо, дальше я сам/сама» — лучший результат нашего взаимодействия.<br /><br />

Форматы работы<br />
• Индивидуальные консультации (онлайн / офлайн, Краснодар)<br />
• Супервизорские группы для психологов<br />
• Терапевтические онлайн группы различной тематики<br />
<br /><br />
Если эти слова отозвались - напишите мне. Я на связи!
            </p>
        </div>
    );
}