'use client';

import Link from 'next/link';
import Image from 'next/image';
import styles from './Public.module.scss';

export default function Public() {
    return (
        <div>
            <div className={styles.main_con}>
                <div className={styles.flex}>
                    <div className={styles.text}>
                        <h2>Договор публичной оферты</h2>
                        <p>ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ<br/>
на оказание консультационных услуг</p>

<p>1. Общие положения<br/>
1.1. Настоящий публичный договор (далее – Договор) представляет собой официальное предложение индивидуального предпринимателя Шамро Андрея Юрьевича (ИНН 231509891349 / ОГРНИП 324237500294652), именуемого в дальнейшем «Исполнитель», по оказанию консультационных возмездных услуг юридическим, а также правоспособным и дееспособным физическим лицам на перечисленных ниже условиях.<br/>
1.2. Согласно статье 437 Гражданского Кодекса Российской Федерации настоящий документ является публичной офертой, и в случае принятия изложенных ниже условий физическое или юридическое лицо, производящее акцепт этой оферты, осуществляет оплату Услуг Исполнителя в соответствии с условиями Договора. <br/>
В соответствии с пунктом 3 статьи 438 ГК РФ, оплата Услуг Исполнителя является акцептом оферты, что считается равносильным заключению Договора на условиях, изложенных в оферте.<br/>
1.3. В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской Федерации (ГК РФ) в случае принятия изложенных в настоящем Договоре условий и оплаты услуг юридическое или физическое лицо, производящее акцепт этой оферты, становится Клиентом.<br/>
1.4. Настоящий Договор заключается между Клиентом и Исполнителем в момент заказа и оплаты услуги и действует до полного исполнения Сторонами своих обязательств.<br/>
1.5. После внесения оплаты Клиент считается принявшим все условия Договора и приложений к нему в полном объеме и без исключений с момента подачи заявки и оплаты услуги, что приравнивается к заключению Договора оказания услуг.<br/>
1.6. Если от Клиента в течение 24-х часов после оказания услуг не поступает письменных возражений, то услуги считаются оказанными в полном объеме и принятыми Клиентом. При этом стороны согласовали, что в таком случае подписание отдельного акта об оказании услуг не требуется.<br/>
1.7. Для целей настоящей публичной оферты применяются следующие основные определения и термины:<br/>
«Сайт» – сайт, размещенный в сети интернет по адресу: https://www.shamro.ru/<br/>
«Оферта» – публичное предложение Исполнителя, адресованное любому правоспособному и дееспособному физическому лицу (гражданину) или юридическому лицу, заключить с ним договор оказания услуг на существующих условиях, содержащихся в Договоре, включая все его приложения.<br/>
«Клиент» – физическое лицо или юридическое лицо, заключившее с Исполнителем Договор на условиях, содержащихся в настоящей оферте.<br/>
«Акцепт» – полное и безоговорочное принятие Клиентом условий Договора.<br/>
«Услуги» – индивидуальные консультации, групповые консультации, онлайн консультации, индивидуальная супервизия, групповая супервизия, стратегическая сессия, онлайн проекты/курсы, информация о которых представлена на сайте: https://www.shamro.ru/#cards</p>

<p>2. Предмет договора<br/>
2.1. Предметом настоящего Договора является предоставление Клиенту различного вида консультационных услуг – индивидуальные консультации, групповые консультации, онлайн консультации, индивидуальная супервизия, групповая супервизия, стратегическая сессия, онлайн проекты/курсы, в соответствии с условиями настоящей публичной оферты и текущими условиями оплаты, указанными в настоящем Договоре.<br/>
2.2. Перечень оказываемых услуг опубликован на сайте в разделе https://www.shamro.ru/#cards, Приложении 1 к настоящему Договору, которое является неотъемлемой его часть.<br/>
2.3. Договор публичной оферты и приложения к нему являются официальными документами и публикуются на Сайте в разделе ссылка.<br/>
2.4. Исполнитель имеет право в любой момент изменять прейскурант и условия настоящей публичной оферты в одностороннем порядке без предварительного согласования с Клиентом, обеспечивая при этом публикацию измененных условий на Сайте, не менее чем за один день до их ввода в действие.</p>

<p>3. Стоимость, порядок оплаты и получения услуг<br/>
3.1. Стоимость услуг указывается в разделах сайта, посвященной каждой отдельной услуге. Любые изменения стоимости услуг заблаговременно публикуются на сайте. Клиент оплачивает не результат, а время, отведенное Исполнителем.<br/>
3.2. Оплата всех услуг по настоящему Договору осуществляется в виде 100% предоплаты и в порядке, устанавливаемом настоящим Договором (за некоторыми исключениями, установленными для некоторых видов услуг).<br/>
3.3. Датой оплаты признается поступление денежных средств на расчетный счет Исполнителя.<br/>
3.4. Оплата услуг по настоящему Договору осуществляется:<br/>
- безналичным перечислением денежных средств через сервис «Robokassa» на расчетный счет Исполнителю по банковским реквизитам, указанным в настоящем Договоре.<br/>
3.5. Клиент самостоятельно несет ответственность за правильность вводимых им данных/реквизитов и производимых платежей.<br/>
3.6. Порядок оплаты и условия оказания консультационных услуг:<br/>
- Клиент оплачивает стоимость услуг в размере, указанном в соответствующих разделах Сайта (раздел договора 2, п. 2.2) в течение 24-х часов после согласования времени и места ее проведения, в порядке, установленном пунктом 3.4. настоящего Договора.<br/>
- Консультации, проводимые в режиме онлайн, с помощью современных способов связи (Zoom, WhatsApp, Telegram и другие мессенджеры, и программы) оплачиваются до начала консультации в полном объеме. На онлайн консультации распространяются все условия, прописанные в пункте 3.4. настоящего договора.<br/>
- Длительность консультации – от 60 (шестидесяти) минут до 120 (ста двадцати) минут.<br/>
- Консультация начинается точно в назначенное время и день. В случае опоздания Клиента, время консультации не продлевается.<br/>
- Клиент может отменить консультацию или перенести на любую другую свободную дату, своевременно предупредив Исполнителя не позднее 24-х часов до времени начала консультации, по контактному номеру телефона, указанному на Сайте, либо иным способом, обеспечивающим своевременную доставку сообщения. При своевременной отмене консультации, Исполнитель возвращает Клиенту денежные средства, оплаченные за несостоявшуюся консультацию. <br/>
Для возврата денежных средств, Клиент оформляет заявление в соответствие с законодательством РФ и направляет Исполнителю по контактным данным, указанным на Сайте.<br/>
- При своевременном согласованном переносе консультации на другую дату, денежные средства, полученные от Клиента, засчитываются в счет оплаты за будущую консультацию.<br/>
- В тех случаях, если Клиент своевременно не предупредил, предупредил менее чем за 24 часа или вообще не предупредил Исполнителя о невозможности явиться на консультацию и не явился на консультацию, то денежные средства, полученные в качестве предоплаты за консультацию Клиенту, не возвращаются, а считаются оплатой понесенных издержек Исполнителя.<br/>
- Если по выбору Клиента консультация проводится не в кабинете Исполнителя и для этого требуется арендовать помещение, то затраты по аренде полностью несет Клиент.<br/>
3.7. Клиент имеет право самостоятельно оформить заявку на любой вид доступной для него консультационной услуги (раздел второй Договора, п. 2.1.) на условиях настоящего Договора публичной оферты.<br/>
3.8. При оформлении заявки Клиент обязан предоставить персональную информацию и контактные данные, необходимые для осуществления Исполнителем своих обязательств.</p>

<p>4. Правила возврата денежных средств<br/>
4.1. Для возврата денежных средств, Клиент уведомляет Исполнителя по номеру телефона Исполнителя, указанному на Сайте, о желании осуществить возврат денежных средств и причинах возврата. После уведомления по телефону, Клиент оформляет заявление в соответствие с законодательством РФ и направляет Исполнителю.<br/>
4.2. В случае отказа Исполнителя от оказания услуг, возврат денег осуществляется в течение 10 (десяти) дней по заявлению Клиента (с указанием всех необходимых банковских реквизитов Клиента) на его расчетный счет.<br/>
4.3. Исполнитель имеет право прекратить дальнейшее оказание услуг без возвращения денежных средств при неадекватном, аморальном и/или антисоциальном поведении Клиента, а также при выяснении, что Клиент является пациентом психиатра, либо состоит на учете в психоневрологическом или наркологическом диспансере, либо имеет недееспособность, или неправоспособность, или умственную отсталость с различной степенью снижения интеллекта, либо имеет органическое поражение мозга, а также, если Клиент является несовершеннолетним при отсутствии согласия со стороны родителей/ опекунов.<br/>
4.4. Правила возврата денежных средств за консультационные услуги:<br/>
- Клиент может отменить консультацию, своевременно предупредив Исполнителя не позднее 24-х часов до времени начала консультации, по контактному номеру телефона, указанному на Сайте либо иным способом, обеспечивающим своевременную доставку сообщения.<br/>
- В случае если Клиент внес 100% предоплату при своевременной отмене консультации, Исполнитель возвращает Клиенту денежные средства, оплаченные за несостоявшуюся консультацию, за вычетом понесенных расходов (налоги, комиссии банков или других платежных систем, связанных с возвратом денежных средств).<br/>
- Если Клиент своевременно не предупредил, предупредил позже указанного выше времени, не предупредил Исполнителя о невозможности явиться на консультацию и не явился на консультацию, то денежные средства, полученные в качестве предоплаты за 1 (один) час консультации Клиенту, не возвращаются.<br/>
- Исполнитель имеет право отказаться от оказания услуг, если запрос Клиента требует участия специалиста с медицинским образованием. В данном случае, если указанное обстоятельство выявилось во время консультации, то денежные средства за консультацию не возвращаются. Если указанное обстоятельство выяснилось за сутки и более до начала консультации, то денежные средства возвращаются Клиенту. Исполнитель уведомляет об этом Клиента, направляя письменное уведомление на электронный адрес Клиента или сообщает по контактному номеру телефона.</p>

<p>5. Права и обязанности сторон<br/>
5.1. Права и обязанности Исполнителя:<br/>
5.1.1. Исполнитель оказывает консультационные Услуги в соответствии с настоящим Договором и дополнительными условиями, указанными в разделах сайта и посвященных различного вида консультационным услугам (раздел договора 2, п. 2.1.).<br/>
5.1.2. Исполнитель оказывает услуги согласно назначенным дате, времени и заявке Клиента. В случае изменения времени назначенной консультации Исполнитель обязан уведомить об этом Клиента не позднее, чем за сутки до начала назначенной консультации.<br/>
5.1.3. Исполнитель имеет право отказаться от оказания услуг, если запрос Клиента требует участия специалиста с медицинским образованием.<br/>
5.1.4. Исполнитель допускает возможность неявки на консультацию в случае форс-мажорных обстоятельств, возникших из-за внешних, не зависящих от Исполнителя обстоятельств, включая неожиданное ухудшение состояния здоровья, которое препятствует оказанию консультационных услуг.<br/>
Под форс-мажорными обстоятельствами, то есть чрезвычайными и непредотвратимыми обстоятельствами, стороны понимают: запретные действия властей, эпидемии, блокады, эмбарго, землетрясения, наводнения, пожары или другие стихийные бедствия.<br/>
5.1.5. Исполнитель имеет право прекратить дальнейшее оказание услуг без возвращения денежных средств в случае неуважительного общения Клиента с Исполнителем, при неадекватном, аморальном и антисоциальном поведении Клиента, а также при выяснении, что Клиент является пациентом психиатра, либо состоит на учете в психоневрологическом или наркологическом диспансере, либо имеет недееспособность или неправоспособность или умственную отсталость с различной степенью снижения интеллекта, либо имеет органическое поражение мозга, а также, если Клиент является несовершеннолетним, а также при несвоевременной оплате консультаций (обучения, супервизии), появления на консультации (обучении) в состоянии алкогольного или наркотического опьянения и других причин, которые Исполнитель посчитает достаточными для прекращения работы.<br/>
5.1.6. Исполнитель с разрешения Клиента имеет право записывать проводимые консультации в целях документирования для более эффективного дальнейшего консультирования Клиента, а также для разбора возможных конфликтных ситуаций.<br/>
5.1.7. Исполнитель может использовать материалы консультаций и переписок с Клиентами в методических целях, в качестве примеров работы, фрагментарно, без указания подробных и/или персональных данных Клиента.<br/>
5.1.8. Содержание и подходы в консультировании определяются Исполнителем и Клиентом совместно, исходя из потребностей Клиента и представлений Исполнителя о конструктивных формах работы, а также личного и профессионального опыта.<br/>
5.1.9. Исполнитель имеет право, при оказании группового формата услуги, привлекать к своей работе третьих лиц, которые могут способствовать повышению эффективности оказания помощи Клиенту (помощь в проведении консультаций). <br/>
При этом оказание услуг осуществляется Исполнителем лично.<br/>
5.1.10. Сохранять анонимность консультирования, кроме случаев, в которых совершены или могут быть совершены преступления согласно Уголовного кодекса РФ.<br/>
5.1.11. Исполнитель своевременно публикует на Сайте и/или направляет по электронной почте официальные сообщения, связанные с любыми изменениями документов, регламентирующих правила работы Исполнителя.<br/>
5.1.12. Исполнитель сохраняет за собой право в одностороннем порядке вносить изменения в настоящий Договор при условии публикации новой редакции на Сайте.<br/>
5.1.13. Исполнитель несет ответственность за хранение и обработку персональных данных Клиента, обеспечивает сохранение конфиденциальности этих данных и обязуется использовать их исключительно для качественного оказания Услуг Клиенту.</p>

<p>5.2. Права и обязанности Клиента<br/>
5.2.1. Клиент обязуется оплатить стоимость выбранного им вида услуг в полном объеме в сроки и порядке, установленном в настоящем Договоре и/или на Сайте.<br/>
5.2.2. Клиент обязуется выполнять домашние задания и рекомендации Исполнителя.<br/>
5.2.3. Клиент обязуется предоставлять достоверные сведения, необходимые для оказания консультационных услуг и достижения качественного результата.<br/>
5.2.4. Клиент обязуется использовать полученные информацию, материалы, рекомендации и любые иные сведения, только в личных интересах, не выполнять их копирование и перенос на носители, в целях дальнейшего распространения и получения выгоды. Выполнение указанных действий является прямым нарушением настоящего Договора и оставляет право Исполнителя на судебное преследование Клиента за нарушение авторских и других прав Исполнителя.<br/>
5.2.5. Клиент обязуется приходить на консультацию в назначенное время. В случае опоздания время опоздания вычитается из продолжительности консультации.<br/>
5.2.6. Клиент имеет право осуществлять отмену или перенос консультации не позднее, чем за 24 часа до назначенного времени. В противном случае Клиент обязан оплатить стоимость консультации. Деньги за несвоевременную отмену и перенос консультации, а также за неявку на консультацию, не возвращаются.<br/>
5.2.7. Клиент имеет право получать от Исполнителя услуги в объеме, количествах и качеству, соответствующих условиям настоящего Договора и соответствующим квалификации Исполнителя.<br/>
5.2.8. В случае отказа Исполнителя от выполнения договора, Клиент вправе потребовать от Исполнителя возвращения денежных средств, перечисленных Исполнителю за еще не проведенную консультацию, за исключением случаев, предусмотренных в разделе 5, п. 5.1., п.п. 4 настоящего Договора.<br/>
5.2.9. Договор-оферта не может быть отозван Клиентом.<br/>
5.2.10. В случае порчи имущества/ причинение ущерба и/или вреда Клиентом Исполнителю - случайно или намеренно, ущерб возмещается Клиентом в полном объеме, в размере эквивалентном полной рыночной стоимости.<br/>
5.2.11. На очной консультации Клиенту запрещается пользоваться электронными устройствами (смартфоны, ноутбуки и т.д.) без разрешения Исполнителя.<br/>
5.2.12. Во время онлайн консультации Клиент обязан пользоваться гарнитурой или наушниками и микрофоном. Клиент на всем протяжении онлайн-сессии должен находиться один, без других людей, детей и животных. В случае, если это будет нарушено, Исполнитель имеет право прервать оказание услуги. Деньги за такую сессию в таком случае не возвращаются.<br/>
5.3. Стороны обязуются обеспечить все необходимые условия для работы и исполнения обязательств по настоящему Договору.<br/>
5.4. Условия работы Исполнителя предполагают со стороны Клиента:<br/>
- подробное, детальное описание ситуации, обстоятельств, своего состояния, ощущений, переживаний;<br/>
- ясные, прямые и искренние ответы на задаваемые Исполнителем вопросы;<br/>
- регулярное выполнение домашних заданий, связанных с разрешением проблемной ситуации Клиента.<br/>
5.5. Клиент самостоятельно несет ответственность за правильность производимых им платежей, вносимых данных/реквизитов.<br/>
5.6. Любая информация, сообщенная Клиентом Исполнителю конфиденциальна, и не выносится за пределы общения между Клиентом и Исполнителем, кроме случаев, в которых совершены или могут быть совершены действия, подпадающие под действие Уголовного кодекса РФ.</p>

<p>6. Ответственность сторон<br/>
6.1. 3а неисполнение или ненадлежащее исполнение своих обязанностей по настоящему Договору Стороны несут ответственность в соответствии с действующим законодательством Российской Федерации.<br/>
6.2. Исполнитель несет ответственность за качество предоставляемых услуг.<br/>
6.3. Исполнитель не несет ответственность за технические неполадки и ошибки в работе Сайта по адресу: https://www.shamro.ru/<br/>
6.4. Исполнитель не несет ответственность за то, каким образом Клиент будет распоряжаться полученной информацией, за те решения, которые принимает Клиент, не отвечает за чувства и эмоции, которые испытывает Клиент, не отвечает за его физическое состояние.<br/>
6.5. Клиент несёт ответственность за все действия, совершённые во время получения Услуг и за достоверность информации, предоставляемой Исполнителю. Недостоверность или неполнота предоставляемой Клиентом информации может привести к отказу Исполнителя от проведения дальнейших консультаций.<br/>
6.6. Клиент отвечает перед самим собой за выполнение (или невыполнение) рекомендаций Исполнителя, применение (или неприменение) в жизни знаний, умений, инсайтов, умозаключений, психологических ресурсов и навыков, полученных в процессе работы с Исполнителем, за достижение (или не достижение) поставленных целей.<br/>
6.7. Исполнитель не дает гарантий или предостережений, письменно или устно, высказанных или предполагаемых, как для достигнутых результатов, так и для любых последствий любых действий или бездействия Клиента. Исполнитель не является ответственным за результаты действий или бездействий Клиента.<br/>
6.8. Клиент несет ответственность за соблюдение им требований законодательства, в том числе законодательства об авторских правах (в частности ст.1255-1259, 1301-1302 ГФ РК, но не ограничиваясь указанным), об интеллектуальной собственности (в частности ст. 1255-1230, 1250-1254 ГК РФ, но не ограничиваясь указанными), но не ограничиваясь перечисленным.</p>

<p>7. Споры, разногласия сторон и прочие условия<br/>
7.1. Стороны обязуются предпринять все меры к разрешению всех споров и разногласий, которые могут возникнуть по настоящему Договору или в связи с ним, путём переговоров.<br/>
Претензионный порядок обязателен для сторон.<br/>
7.2. Любые споры и разногласия Сторон по настоящему Договору или в связи с ним, которые не были урегулированы путём переговоров Сторон в течение календарного месяца с момента возникновения спора, подлежат разрешению в соответствии с действующим законодательством Российской Федерации, в соответствующих судах по месту регистрации Исполнителя.<br/>
7.3. Все приложения к Договору, опубликованные на сайте https://www.shamro.ru/ являются его неотъемлемыми частями.</p>

<p>8. Конфиденциальность<br/>
8.1. Факт заключения настоящего Договора не рассматривается Сторонами как конфиденциальная информация.<br/>
8.2. Стороны обязуются не разглашать информацию, полученную Сторонами в ходе выполнения своих обязательств по настоящему Договору, за исключением случаев, когда Сторона обязана предоставить такую информацию в соответствии с действующим законодательством, применимым к Договору, или было получено согласие на разглашение такой информации.</p>

<p>9. Реквизиты Исполнителя<br/>
Индивидуальный предприниматель Шамро Андрей Юрьевич <br/>
ИНН: 231509891349 / ОГНИП 324237500294652<br/>
Телефон: +79180122424<br/>
Электронная почта: andreywind69@mail.ru</p><br/>


                    </div>
                </div>
            </div>
        </div>
    );
}